# ANALYSIS OF IMDB MOVIE DATASET USING SQL

In [ ]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [ ]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [ ]:
conn = sqlite3.connect("/content/Db-IMDB.db")

#### Overview of all tables

In [ ]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [ ]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [ ]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """ SELECT m.title,CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) AS yr,pn.Name 
              FROM Movie AS m 
              JOIN M_director AS d ON m.MID=d.MID 
              JOIN Person AS pn ON d.PID=pn.PID 
              JOIN M_Genre AS mg ON m.MID=mg.MID 
              JOIN Genre AS g ON mg.GID=g.GID 
              WHERE g.Name LIKE'%Comedy%'
                AND (yr%4=0 
                AND yr%100!=0 
                OR yr%400=0 )
              ORDER BY m.year"""
grader_1(query1)

             title    yr             Name
0       Jagte Raho  1956       Amit Mitra
1         Funtoosh  1956     Chetan Anand
2          Jagriti  1956      Satyen Bose
3        New Delhi  1956      Mohan Segal
4         Kohinoor  1960       S.U. Sunny
5           Parakh  1960        Bimal Roy
6    Love in Simla  1960      R.K. Nayyar
7         Rajkumar  1964       K. Shankar
8  Kashmir Ki Kali  1964   Shakti Samanta
9           Leader  1964    Ram Mukherjee
CPU times: user 67 ms, sys: 900 µs, total: 67.9 ms
Wall time: 71.6 ms

## List the names of all the actors who played in the movie 'Anand' (1971)

In [ ]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results)
    assert (q2_results.shape == (17,1))


query2 = """SELECT pn.Name 
            FROM Person AS pn 
            JOIN M_Cast AS mc ON TRIM(pn.PID) = TRIM(mc.PID) 
            JOIN Movie AS m ON mc.MID=m.MID 
              WHERE m.title LIKE 'Anand'"""
grader_2(query2)

                 Name
0    Amitabh Bachchan
1       Rajesh Khanna
2       Sumita Sanyal
3          Ramesh Deo
4           Seema Deo
5      Asit Kumar Sen
6          Dev Kishan
7        Atam Prakash
8       Lalita Kumari
9              Savita
10     Brahm Bhardwaj
11       Gurnam Singh
12       Lalita Pawar
13        Durga Khote
14         Dara Singh
15      Johnny Walker
16          Moolchand
CPU times: user 268 ms, sys: 15.4 ms, total: 283 ms
Wall time: 287 ms

## List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [ ]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    print(q3_a)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    print(q3_b)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
            PID
0     nm0719692
1     nm0623658
2     nm0549280
3     nm0415488
4     nm0336474
...         ...
4937  nm0004660
4938  nm0672784
4939  nm0482285
4940  nm0004334
4941  nm0066829

[4942 rows x 1 columns]
(62570, 1)
             PID
0      nm0000288
1      nm0000949
2      nm1212722
3      nm0365140
4      nm0785227
...          ...
62565  nm0664109
62566  nm0505323
62567  nm0019427
62568  nm0197582
62569  nm0438467

[62570 rows x 1 columns]
True
CPU times: user 270 ms, sys: 11.7 ms, total: 281 ms
Wall time: 295 ms

In [ ]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """select distinct p.Name 
            from Movie m 
            join M_Cast mc on m.MID=mc.MID 
            join Person p on trim(mc.PID)=trim(p.PID)
            where p.PID in 
            (Select p.PID from Person p 
            inner join 
            (
                select trim(mc.PID) PD, mc.MID 
                from M_cast mc 
            where mc.MID 
            in 
            (
                select mv.MID from Movie mv 
                where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
            )
            ) r1 
            on r1.PD=p.PID 
            )
            AND p.PID IN
            (Select p.PID from Person p 
            inner join 
            (
                select trim(mc.PID) PD, mc.MID from M_cast mc 
            where mc.MID 
            in 
            (
                select mv.MID from Movie mv 
                where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
            )
            ) r1 
            on r1.PD=p.PID 
            )
"""
grader_3(query3)

                Name
0       Rishi Kapoor
1   Amitabh Bachchan
2             Asrani
3       Zohra Sehgal
4    Parikshat Sahni
5      Rakesh Sharma
6        Sanjay Dutt
7          Ric Young
8              Yusuf
9     Suhasini Mulay
CPU times: user 7.02 s, sys: 378 ms, total: 7.4 s
Wall time: 7.42 s

## List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [ ]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a ="""SELECT p.PID Director_ID,COUNT(m.MID) Movie_Count 
             FROM Movie m 
             JOIN M_Director md ON m.MID=md.MID 
             JOIN Person p ON md.PID=p.PID 
             GROUP BY p.PID """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

  Director_ID  Movie_Count
0   nm0000180            1
1   nm0000187            1
2   nm0000229            1
3   nm0000269            1
4   nm0000386            1
5   nm0000487            2
6   nm0000965            1
7   nm0001060            1
8   nm0001162            1
9   nm0001241            1
True
CPU times: user 59.3 ms, sys: 976 µs, total: 60.3 ms
Wall time: 64.1 ms

In [ ]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """ SELECT p.Name Director_Name,COUNT(m.MID) Movie_Count 
              FROM Movie m 
              JOIN M_Director md ON m.MID=md.MID 
              JOIN Person p ON md.PID=p.PID GROUP BY Director_Name 
              HAVING Movie_Count>=10 
              ORDER BY Movie_Count DESC"""
grader_4(query4)

           Director_Name  Movie_Count
0           David Dhawan           39
1           Mahesh Bhatt           36
2        Ram Gopal Varma           30
3           Priyadarshan           30
4           Vikram Bhatt           29
5   Hrishikesh Mukherjee           27
6            Yash Chopra           21
7        Basu Chatterjee           19
8         Shakti Samanta           19
9           Subhash Ghai           18
CPU times: user 66.4 ms, sys: 1.72 ms, total: 68.1 ms
Wall time: 69.5 ms

## For each year, count the number of movies in that year that had only female actors.

In [ ]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa) 
    return (query_5aa.shape == (8846,3))
 
query_5aa =""" 
                    SELECT TRIM(MC.MID) MID,P.Gender, COUNT(P.Gender) count
                    FROM M_Cast MC,Person P
                    WHERE  TRIM(MC.PID)= P.PID
                    GROUP BY MID,P.Gender
                """

grader_5aa(query_5aa)

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab =""" SELECT TRIM(MC.MID) MID,P.Gender, COUNT(P.Gender) count
                    FROM M_Cast MC,Person P
                    WHERE  TRIM(MC.PID)= P.PID 
                    GROUP BY MID,P.Gender 
                    HAVING COUNT(P.Gender='Male')>=1 AND P.Gender='Male'"""

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

            MID  Gender  count
0     tt0021594    None      0
1     tt0021594  Female      3
2     tt0021594    Male      5
3     tt0026274    None      0
4     tt0026274  Female     11
...         ...     ...    ...
8841  tt8932884  Female      1
8842  tt8932884    Male      2
8843  tt9007142    None      0
8844  tt9007142  Female      4
8845  tt9007142    Male      5

[8846 rows x 3 columns]
         MID Gender  count
0  tt0021594   Male      5
1  tt0026274   Male      9
2  tt0027256   Male      8
3  tt0028217   Male      7
4  tt0031580   Male     27
5  tt0033616   Male     46
6  tt0036077   Male     11
7  tt0038491   Male      7
8  tt0039654   Male      6
9  tt0040067   Male     10
True
CPU times: user 316 ms, sys: 6.91 ms, total: 323 ms
Wall time: 324 ms

In [ ]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """ select m.year, count(*) as movie_count 
              from Movie m
              join (select distinct mid from M_Cast  
              where mid not in 
                (
                  select mc.mid from M_Cast mc 
                  join Person p on p.pid = trim(mc.pid)
                  where p.gender = 'Male'
                )
              )g on g.mid = m.mid   
              group by m.year """
grader_5a(query5a)

     year  movie_count
0    1939            1
1    1999            1
2    2000            1
3  I 2018            1
CPU times: user 187 ms, sys: 5.04 ms, total: 192 ms
Wall time: 196 ms

## Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [ ]:
#REFERENCE:https://github.com/BhargavTumu/SQL-Practice-Questions/blob/master/Solutions.sql
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results)
    assert (q5b_results.shape == (4,3))

query5b = """ WITH
    MOV_WITH_NON_FEMALE AS
    (
        SELECT
            DISTINCT
            MC.MID MID
        FROM
                    M_Cast MC
            JOIN    Person P
            ON      P.PID=TRIM(MC.PID)
        WHERE
            P.Gender IN ('Male','None') 
    ),
    NUM_OF_MOV_WITH_ONLY_F_BY_YR AS
    (
    SELECT
        CAST(SUBSTR(M.year,-4) AS INTEGER) YEAR,
        COUNT(DISTINCT TRIM(MID) ) NUM_OF_MOV_WITH_ONLY_FEMALES
    FROM
        Movie M
    WHERE
        MID NOT IN (SELECT MID FROM MOV_WITH_NON_FEMALE)
    GROUP BY 
        CAST(SUBSTR(M.year,-4) AS INTEGER)
    ),
    TOTAL_NUM_OF_MOV_BY_YEAR AS
    (
        SELECT
            CAST(SUBSTR(M.year,-4) AS INTEGER) YEAR,
            COUNT(DISTINCT MID ) TOTAL_NUM_OF_MOV
        FROM
            Movie M
        GROUP BY
            CAST(SUBSTR(M.year,-4) AS INTEGER)
    )
    SELECT
        TOT_MOV.YEAR,
        TOT_MOV.TOTAL_NUM_OF_MOV,
        ROUND((MOV_F.NUM_OF_MOV_WITH_ONLY_FEMALES)*100.0/TOT_MOV.TOTAL_NUM_OF_MOV,1) PERCENT_OF_MOV_WITH_ONLY_FEMALE
    FROM
                TOTAL_NUM_OF_MOV_BY_YEAR TOT_MOV
        JOIN
                NUM_OF_MOV_WITH_ONLY_F_BY_YR MOV_F
        ON      TOT_MOV.YEAR = MOV_F.YEAR
        WHERE PERCENT_OF_MOV_WITH_ONLY_FEMALE!=0
    ORDER BY
        PERCENT_OF_MOV_WITH_ONLY_FEMALE DESC;
"""
grader_5b(query5b)

   YEAR  TOTAL_NUM_OF_MOV  PERCENT_OF_MOV_WITH_ONLY_FEMALE
0  1939                 2                             50.0
1  2000                64                              1.6
2  1999                66                              1.5
3  2018               104                              1.0
CPU times: user 161 ms, sys: 799 µs, total: 162 ms
Wall time: 166 ms

## Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [ ]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ SELECT m.title,COUNT(mc.PID) count 
             FROM Movie m 
             JOIN M_Cast mc ON m.MID=mc.MID 
             GROUP BY m.MID 
             ORDER BY count DESC"""
grader_6(query6)

                        title  count
0               Ocean's Eight    238
1                    Apaharan    233
2                        Gold    215
3             My Name Is Khan    213
4  Captain America: Civil War    191
5                    Geostorm    170
6                     Striker    165
7                        2012    154
8                      Pixels    144
9       Yamla Pagla Deewana 2    140
CPU times: user 166 ms, sys: 10.7 ms, total: 176 ms
Wall time: 186 ms

### A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [ ]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))
#*** Write a query that computes number of movies in each year ***
query7a = """ SELECT CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) Movie_Year, COUNT(m.title) Total_Movies 
              FROM Movie m GROUP BY Movie_Year 
              ORDER BY Movie_Year """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   Movie_Year  Total_Movies
0        1931             1
1        1936             3
2        1939             2
3        1941             1
4        1943             1
5        1946             2
6        1947             2
7        1948             3
8        1949             3
9        1950             2
CPU times: user 9.18 ms, sys: 1.04 ms, total: 10.2 ms
Wall time: 11.6 ms

In [ ]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results)
    assert (q7b_results.shape == (713, 4))
query7b = """WITH S1 AS
              (
                SELECT CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) Movie_Year, COUNT(m.title) Total_Movies 
              FROM Movie m GROUP BY Movie_Year 
              ORDER BY Movie_Year
              ),
              S2 AS
              (
                SELECT CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) Movie_Year, COUNT(m.title) Total_Movies 
              FROM Movie m GROUP BY Movie_Year 
              ORDER BY Movie_Year
              )
            
              SELECT S1.Movie_Year M1,S1.Total_Movies T1,S2.Movie_Year M2,S2.Total_Movies T2
              FROM S1 LEFT JOIN S2 
              ON M2 <=M1+9 AND M2 >= M1
              UNION ALL
              
              SELECT S1.Movie_Year M1,S1.Total_Movies T1,S2.Movie_Year M2,S2.Total_Movies T2
              FROM S2 LEFT JOIN S1 
              ON M2 <=M1+9 AND M2 >= M1
              WHERE M2 IS NULL
             
             
             
                  """
grader_7b(query7b)
#HAVING m2.year<= m.year+9 AND m2.year>=m.year WHERE m2.year<= m.year+9 || m2.year>=m.year
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

       M1   T1    M2   T2
0    1931    1  1931    1
1    1931    1  1936    3
2    1931    1  1939    2
3    1936    3  1936    3
4    1936    3  1939    2
..    ...  ...   ...  ...
708  2016  129  2017  126
709  2016  129  2018  104
710  2017  126  2017  126
711  2017  126  2018  104
712  2018  104  2018  104

[713 rows x 4 columns]
CPU times: user 15.4 ms, sys: 1.91 ms, total: 17.3 ms
Wall time: 17.9 ms

In [ ]:
#REFERENCE:https://github.com/BhargavTumu/SQL-Practice-Questions/blob/master/Solutions.sql
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))
#*** Write a query that will return the decade that has maximum number of movies ***
query7 = """ WITH 
    DISTINCT_YEARS AS
    (
    SELECT
        DISTINCT
        CAST(SUBSTR(year,-4) AS UNSIGNED) YEAR,
        CAST(SUBSTR(year,-4) AS UNSIGNED) START_OF_DECADE,
        CAST(SUBSTR(year,-4) AS UNSIGNED)+9 END_OF_DECADE,
        'Decade of : ' || SUBSTR(year,-4)  DECADE
    FROM
        Movie
    ),
    NUMBER_OF_MOV_BY_YR AS
    (
    SELECT
    COUNT(DISTINCT MID) NUM_OF_MOV,
    CAST(SUBSTR(year,-4) AS UNSIGNED) YEAR
    FROM
        Movie
    GROUP BY
        CAST(SUBSTR(year,-4) AS UNSIGNED)
    ),
    NUM_OF_MOV_IN_DECADE AS 
    (
    SELECT
        SUM(NUM_OF_MOV) TOTAL_MOVIES,
        DY.DECADE
    FROM
        NUMBER_OF_MOV_BY_YR NM,
        DISTINCT_YEARS DY
    WHERE
        NM.YEAR BETWEEN DY.START_OF_DECADE AND DY.END_OF_DECADE
    GROUP BY
        DY.DECADE
    )
    SELECT
        DECADE,
        TOTAL_MOVIES
    FROM
        NUM_OF_MOV_IN_DECADE
    WHERE
        TOTAL_MOVIES = (
            SELECT
                MAX(TOTAL_MOVIES)
            FROM
                NUM_OF_MOV_IN_DECADE
            )"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

             DECADE  TOTAL_MOVIES
0  Decade of : 2008          1203
CPU times: user 25.7 ms, sys: 0 ns, total: 25.7 ms
Wall time: 38.2 ms

## Find all the actors that made more movies with Yash Chopra than any other director.

In [ ]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))
#*** Write a query that will results in number of movies actor-director worked together ***
query8a = """ SELECT DISTINCT mc.PID actor,md.PID director,COUNT(md.MID) movies 
              FROM M_Director md 
              JOIN M_Cast mc ON md.MID=mc.MID 
              GROUP BY  mc.PID,md.PID"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

        actor   director  movies
0   nm0000002  nm0496746       1
1   nm0000027  nm0000180       1
2   nm0000039  nm0896533       1
3   nm0000042  nm0896533       1
4   nm0000047  nm0004292       1
5   nm0000073  nm0485943       1
6   nm0000076  nm0000229       1
7   nm0000092  nm0178997       1
8   nm0000093  nm0000269       1
9   nm0000096  nm0113819       1
CPU times: user 401 ms, sys: 25.9 ms, total: 427 ms
Wall time: 429 ms

In [ ]:
#REFERENCE:https://github.com/BhargavTumu/SQL-Practice-Questions/blob/master/Solutions.sql
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """WITH
    YASH_CHOPRAS_PID AS
    (
        SELECT
            TRIM(p.PID) AS PID
        FROM
            Person p
        WHERE
            Trim(p.Name) = 'Yash Chopra'
    ),
    NUM_OF_MOV_BY_ACTOR_DIRECTOR AS
    (
        SELECT
            TRIM(MC.PID) actor_pid,
            MD.PID dir_pid,
            COUNT(DISTINCT TRIM(MD.MID)) AS NUM_OF_MOV
        FROM
            M_Cast MC,
            M_Director MD
        WHERE
            trim(MC.MID)= MD.MID
        GROUP BY
            dir_pid,
            actor_pid
    ),
    NUM_OF_MOVIES_BY_YC AS
    (
        SELECT
            NM.dir_pid,
            NM.actor_pid,
            NM.NUM_OF_MOV NUM_OF_MOV_BY_YC
        FROM
            NUM_OF_MOV_BY_ACTOR_DIRECTOR NM,
            YASH_CHOPRAS_PID YCP
        WHERE
            NM.dir_pid = YCP.PID
    ),
    MAX_MOV_BY_OTHER_DIRECTORS AS
    (
        SELECT
            actor_pid,
            MAX(NUM_OF_MOV) MAX_NUM_OF_MOV
        FROM
            NUM_OF_MOV_BY_ACTOR_DIRECTOR NM,
            YASH_CHOPRAS_PID YCP
        WHERE
            NM.dir_pid <> YCP.PID 
        GROUP BY
            actor_pid
    ),
    ACTORS_MOV_COMPARISION AS
    (
    SELECT
        NMY.actor_pid,
        CASE WHEN NMY.NUM_OF_MOV_BY_YC >= IFNULL(NMO.MAX_NUM_OF_MOV,0) THEN 'Y' ELSE 'N' END MORE_MOV_BY_YC
    FROM
        NUM_OF_MOVIES_BY_YC NMY
        LEFT OUTER JOIN
        MAX_MOV_BY_OTHER_DIRECTORS NMO
        ON
        NMY.actor_pid = NMO.actor_pid
    )
    SELECT
        
        p.Name Name,NMY.NUM_OF_MOV_BY_YC Count
    FROM
         Person p JOIN NUM_OF_MOVIES_BY_YC NMY on p.PID=NMY.actor_pid
    WHERE
        p.PID IN (
            SELECT
               DISTINCT 
                actor_pid
            FROM
                ACTORS_MOV_COMPARISION
            WHERE
                MORE_MOV_BY_YC = 'Y'
                

        )
        ORDER BY NMY.NUM_OF_MOV_BY_YC DESC
        """
grader_8(query8)

                Name  Count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3      Shashi Kapoor      7
4      Rakhee Gulzar      5
5     Waheeda Rehman      5
6           Ravikant      4
7     Achala Sachdev      4
8        Neetu Singh      4
9      Leela Chitnis      3
(245, 2)
CPU times: user 1.23 s, sys: 36.9 ms, total: 1.27 s
Wall time: 1.27 s

## The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [ ]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """   WITH 
    SHAHRUKH_0 AS
    (
        SELECT
            TRIM(P.PID) PID
        FROM
            Person P
        WHERE
            Trim(P.Name) like '%shah rukh%'
    ),
    SHAHRUKH_1_MOVS AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID,
            S0.PID
        FROM
            M_Cast MC,
            SHAHRUKH_0 S0
        WHERE
            TRIM(MC.PID) = S0.PID
    )
   
    
        SELECT
            DISTINCT
            TRIM(MC.PID) PID
        FROM
            M_Cast MC,
            SHAHRUKH_1_MOVS S1M
        WHERE
            TRIM(MC.MID) = S1M.MID AND
            TRIM(MC.PID) <> S1M.PID
              
              """
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

         PID
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
CPU times: user 63.6 ms, sys: 3.87 ms, total: 67.5 ms
Wall time: 73.6 ms

In [ ]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """WITH 
    SHAHRUKH_0 AS
    (
        SELECT
            TRIM(P.PID) PID
        FROM
            Person P
        WHERE
            Trim(P.Name) like '%shah rukh%'
    ),
    SHAHRUKH_1_MOVS AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID,
            S0.PID
        FROM
            M_Cast MC,
            SHAHRUKH_0 S0
        WHERE
            TRIM(MC.PID) = S0.PID
    ),
    SHAHRUKH_1_ACTORS AS
    (
        SELECT
            DISTINCT
            TRIM(MC.PID) PID
        FROM
            M_Cast MC,
            SHAHRUKH_1_MOVS S1M
        WHERE
            TRIM(MC.MID) = S1M.MID AND
            TRIM(MC.PID) <> S1M.PID
   ),
    SHAHRUKH_2_MOVS AS
    (
        SELECT
            DISTINCT
            TRIM(MC.MID) MID
          
        FROM
            M_Cast MC,
            SHAHRUKH_1_ACTORS S1A
        WHERE
            TRIM(MC.PID) = S1A.PID 
            ),
       SHAHRUKH_2_ACTORS AS
       (   
     SELECT DISTINCT TRIM(MC.PID) PID
      FROM M_Cast MC,SHAHRUKH_2_MOVS S2M, SHAHRUKH_0 S0
      WHERE TRIM(MC.MID)=S2M.MID AND 
      TRIM(MC.PID) != S0.PID
   ),
   ONLY_S2 AS
   (
   SELECT DISTINCT TRIM(S2A.PID) PID
   FROM SHAHRUKH_2_ACTORS S2A LEFT JOIN SHAHRUKH_1_ACTORS S1A ON S2A.PID = S1A.PID
   WHERE S1A.PID IS NULL
    )
    SELECT trim(P.Name) Name
    FROM Person P, ONLY_S2 OS2
    WHERE P.PID=OS2.PID"""
grader_9(query9)

                    Name
0           Freida Pinto
1            Rohan Chand
2           Damian Young
3        Waris Ahluwalia
4  Caroline Christl Long
5          Rajeev Pahuja
6      Michelle Santiago
7        Alicia Vikander
8           Dominic West
9         Walton Goggins
(25698, 1)
CPU times: user 447 ms, sys: 12.9 ms, total: 460 ms
Wall time: 461 ms